import numpy as np


Chengdu_Subway_Line = {
    # 三号线
    "成都医学院": ["西南石油大学"],
    "西南石油大学": ["成都医学院", "钟楼"],
    "钟楼": ["马超西路", "西南石油大学"],
    "马超西路": ["钟楼", "团结新村"],
    "团结新村": ["锦水河", "马超西路"],
    "锦水河": ["三河场", "团结新村"],
    "三河场": ["金华寺东路", "锦水河"],
    "金华寺东路": ["植物园", "三河场"],
    "植物园": ["军区总医院", "金华寺东路"],
    "军区总医院": ["熊猫大道", "植物园"],
    "熊猫大道": ["动物园", "军区总医院"],
    "动物园": ["昭觉寺南路", "熊猫大道"],
    "昭觉寺南路": ["驷马桥", "动物园"],
    "驷马桥": ["李家沱", "北站西二路", "府青路"],
    "李家沱": ["前锋路", "驷马桥"],
    "前锋路": ["红星桥", "李家沱"],
    "红星桥": ["市二医院", "前锋路"],
    "市二医院": ["春熙路", "太升南路", "玉双路"],
    "春熙路": ["新南门", "市二医院", "天府广场", "东门大桥"],
    "新南门": ["磨子桥", "春熙路",],
    "磨子桥": ["省体育馆", "新南门"],
    "省体育馆": ["衣冠庙", "磨子桥", "华西坝", "倪家桥"],
    "衣冠庙": ["高升桥", "省体育馆"],
    "高升桥": ["红牌楼", "衣冠庙"],
    "红牌楼": ["太平园", "高升桥"],
    "太平园": ["川藏立交", "红牌楼", "武侯大道", "高朋大道"],
    "川藏立交": ["武侯立交", "太平园"],
    "武侯立交": ["武青南路", "川藏立交"],
    "武青南路": ["双凤桥", "武侯立交"],
    "双凤桥": ["龙桥路", "武青南路"],
    "龙桥路": ["航都大街", "双凤桥"],
    "航都大道": ["迎春桥", "龙桥路"],
    "迎春桥": ["东升", "航都大道"],
    "东升": ["双流广场", "迎春桥"],
    "双流广场": ["三里坝", "东升"],
    "三里坝": ["双流西站", "双流广场"],
    # 1号线
    "韦家碾": ["升仙湖"],
    "升仙湖": ["北站西二路", "韦家碾"],
    "北站西二路": ["人民北路", "升仙湖", "火车北站", "驷马桥"],
    "人民北路": ["文殊院", "北站西二路"],
    "文殊院": ["骡马市", "人民北路"],
    "骡马市": ["天府广场", "文殊院", "宽窄巷子", "太升南路"],
    "天府广场": ["锦江宾馆", "骡马市", "人民公园", "春熙路"],
    "锦江宾馆": ["华西坝", "天府广场"],
    "华西坝": ["省体育馆", "锦江宾馆"],
    # 省体育馆上面有了，就不写了
    "倪家桥": ["桐梓林", "省体育馆"],
    "桐梓林": ["火车南站", "倪家桥"],
    "火车南站": ["高新", "桐梓林", "神仙树", "三瓦窑"],
    "高新": ["金融城", "火车南站"],
    "金融城": ["孵化园", "高新"],
    "孵化园": ["锦城广场", "金融城"],
    "锦城广场": ["世纪城", "孵化园"],
    "世纪城": ["天府三街", "锦城广场"],
    "天府三街": ["天府五街", "世纪城"],
    "天府五街": ["华府大道", "天府三街"],
    "华府大道": ["四河", "天府五街"],
    "四河": ["广都", "华府大道", "华阳"],
    "广都": ["五根松", "四河"],
    "五根松": ["广都"],
    "华阳": ["海昌路", "四河"],
    "海昌路": ["广福", "华阳"],
    "广福": ["红石公园", "海昌路"],
    "红石公园": ["麓湖", "武汉路"],
    "武汉路": ["天府公园", "红石公园"],
    "天府公园": ["西博城", "武汉路"],
    "西博园": ["广州路", "天府公园"],
    "广州路": ["兴隆湖", "西博园"],
    "兴隆湖": ["科学城", "广州路"],

    # 7号线
    "府青路": ["八里庄", "驷马桥"],
    "八里庄": ["二仙桥", "府青路"],
    "二仙桥": ["理工大学", "八里庄"],
    "理工大学": ["崔家店", "二仙桥"],
    "崔家店": ["双店路", "理工大学"],
    "双店路": ["槐树店", "崔家店"],
    "槐树店": ["迎晖路", "双店路", "万年场", "来龙"],
    "迎晖路": ["成都东客站", "槐树店"],
    "成都东客站": ["大观", "迎晖路", "塔子山公园", "成渝立交"],
    "大观": ["狮子山", "成都东客站"],
    "狮子山": ["四川师大", "大观"],
    "四川师大": ["琉璃场", "狮子山"],
    "琉璃场": ["三瓦窑", "四川师大"],
    "三瓦窑": ["火车南站", "琉璃场"],
    # 火车南站上面有了
    "神仙树": ["高朋大道", "火车南站"],
    "高朋大道": ["太平园", "神仙树"],
    # 太平园上面有了
    "武侯大道": ["龙爪堰", "太平园"],
    "龙爪堰": ["东坡路", "武侯大道"],
    "东坡路": ["文化宫", "龙爪堰"],
    # 文化宫上面打了
    "金沙博物馆": ["一品天下", "文化宫"],
    "一品天下": ["茶店子", "金沙博物馆", "羊犀立交", "蜀汉路东"],
    "茶店子": ["花照壁", "一品天下"],
    "花照壁": ["西南交大", "茶店子"],
    "西南交大": ["九里堤", "花照壁"],
    "九里堤": ["火车北站", "槐树店"],
    "火车北站": ["北站西二路", "九里堤"],

    # 4号线
    "万盛": ["杨柳河"],
    "杨柳河": ["凤溪河", "万盛"],
    "凤溪河": ["南熏大道", "杨柳河"],
    "南熏大道": [ "光华公园", "凤溪河"],
    "光华公园": ["涌泉", "南熏大道"],
    "涌泉": ["凤凰大街", "光华公园"],
    "凤凰大街": ["马厂坝", "涌泉"],
    "马厂坝": ["非遗博览园", "凤凰大街"],
    "非遗博览园": ["蔡桥", "马厂坝"],
    "蔡桥": ["中坝", "非遗博览园"],
    "中坝": ["成都西站", "蔡桥"],
    "成都西站": ["清江西路", "中坝"],
    "清江西路": ["文化宫", "成都西站"],
    "文化宫": ["西南财大", "东坡路", "金沙博物馆", "清江西路"],
    "西南财大": ["草堂北路", "文化宫"],
    "草堂北路": ["中医大省医院", "西南财大"],
    "中医大省医院": ["宽窄巷子", "草堂北路", "白果林", "通惠门"],
    "宽窄巷子": ["骡马市", "中医大省医院", "文殊院", "天府广场"],
    "骡马市": ["太升南路", "宽窄巷子"],
    "太升南路": ["市二医院", "骡马市"],
    "市二医院": ["玉双路", "太升南路", "红星桥", "春熙路"],
    "玉双路": ["双桥路", "市二医院"],
    "双桥路": ["万年场", "玉双路"],
    "万年场": ["槐树路", "双桥路"],
    "槐树路": ["来龙", "万年场", "双店路", "迎晖路"],
    "来龙": ["十陵", "槐树路"],
    "十陵": ["成都大学", "来龙"],
    "成都大学": ["明蜀王陵", "十陵"],
    "明蜀王陵": ["西河", "成都大学"],
    "西河": ["明蜀王陵"],

    # 2号线
    "东门大桥": ["春熙路"],
    "人民公园": ["天府广场"],
    "白果林": ["中医大省医院"],
    "通惠门": ["中医大省医院"],
    "塔子山公园": ["成都东客站"],
    "成渝立交": ["成都东客站"],
    "羊犀立交": ["一品天下"],
    "蜀汉路东": ["一品天下"]

}

def BFS(graph , s, end):  # graph图  s指的是开始结点,end是结束节点
    queue = []
    parents = {}
    queue.append(s)
    visited = set()
    visited.add(s)
    while len(queue) > 0:
        vertex = queue.pop(0)  # pop移除列表中的一个元素
        if vertex == end:
            print("已找到目标节点！")
            return parents
        nodes = graph[vertex]  # 子节点的数组
        for w in nodes:
            if w not in visited:  # 判断是否访问过，使用一个数组
                queue.append(w)
                visited.add(w)
                parents[w] = vertex  # 追溯父节点
        print(vertex)

def find_way(parents, start, end):
    trace = []
    trace.append(end)
    while(parents[end] != start):
        end = parents[end]
        trace.append(parents[end])
    trace.reverse()
    return trace

if __name__ == '__main__':
    parents = BFS(Chengdu_Subway_Line, "西南石油大学", "天府三街")
    trace = find_way(parents, "西南石油大学", "天府三街")
    print("最短路径已找到:", trace)